using UnityEngine;
using System.Collections;
/*
 * 统计类 - 按钮枚举 - 按钮编号与按钮名称对应
 * 王明磊
 * 2013.8.1
 */

public enum StatisticsEnum
{
	Btn1 = 1, 
	//"进入游戏"按钮
	
	Btn2,  
	//"服务器选择"按钮
	
	Btn3,  
	//"钟灵"角色选择
	
	Btn4,  
	//"木婉清"角色选择
	
	Btn5,  
	//"王语嫣"角色选择
	
	Btn6,  
	//"阿朱"角色选择
	
	Btn7,  
	//"银川"角色选择
	
	Btn8,  
	//角色选择界面"选择侠士"按钮
	
	Btn9,  
	//角色选择_查看角色信息界面"确定"按钮
	
	Btn10, 
	//角色选择_查看角色信息界面"返回"按钮
	
	Btn11, 
	//新手引导"选择队长"按钮
	
	Btn12, 
	//新手引导选择队长-选择一张卡牌
	
	Btn13, 
	//新手引导"选择队员"按钮
	
	Btn14,
	//新手引导选择队员-选择一张卡牌-后点击"确定"按钮
	
	Btn15, 
	//新手引导-点击"武林"按钮
	
	Btn16, 
	//新手引导-点击"无量山"副本群按钮
	
	Btn17, 
	//新手引导-点击"无量剑西宗"副本按钮
	
	Btn18, 
	//新手引导-选择助战好友
	
	Btn19, 
	//新手引导-"开始战斗"
	
	Btn20, 
	//新手引导-第一关打完后的前进按钮
	
	Btn21, 
	//新手引导-第二关打完后的前进按钮
	
	Btn22, 
	//新手引导-"合成按钮"
	
	Btn23, 
	//新手引导-合成卡牌选择
	
	Btn24, 
	//新手引导-合成卡牌-选择一张卡牌
	
	Btn25, 
	//新手引导-材料卡牌选择
	
	Btn26, 
	//新手引导-材料卡牌-选择一张卡牌-后点击"确定"按钮
	
	Btn27, 
	//新手引导-"升级按钮"
	
	Btn28, 
	//新手引导-卡牌合成-"返回"按钮
	
	Btn29, 
	//新手引导-"修炼"按钮
	
	Btn30, 
	//新手引导-选择修炼侠士
	
	Btn31, 
	//新手引导-选择修炼侠士-选择一张卡牌
	
	Btn32, 
	//新手引导-"大力丸"按钮
	
	Btn33, 
	//新手引导-"强身丹"按钮
	
	Btn34, 
	//新手引导-修炼-"返回"按钮
	
	Btn35, 
	//新手引导-"商铺"按钮
	
	Btn36, 
	//新手引导-"元宝抽奖"按钮
	
	Btn37, 
	//新手引导-抽奖-"抽一次"按钮
	
	Btn38, 
	//"主页"按钮
	
	Btn39, 
	//"武林"按钮
	
	Btn40, 
	//"挑战"按钮
	
	Btn41, 
	//"商铺"按钮
	
	Btn42, 
	//"好友"按钮
	
	Btn43, 
	//"帮助"按钮
	
	Btn44, 
	//"卡牌"按钮
	
	Btn45, 
	//"合成"按钮
	
	Btn46, 
	//"精进"按钮
	
	Btn47, 
	//"奖赏"按钮
	
	Btn48, 
	//"修炼"按钮
	
	Btn49, 
	//"书信"按钮
	
	Btn50, 
	//"队长选择"
	
	Btn51, 
	//"队员选择"
	
	Btn52, 
	//长按信息栏呼出信息
	
	Btn53, 
	//好友"添加"按钮
	
	Btn54, 
	//好友"查询"按钮
	
	Btn55, 
	//"攻略"按钮
	
	Btn56, 
	//"图鉴"按钮
	
	Btn57, 
	//"系统设计"按钮
	
	Btn58, 
	//商店-"充值"按钮
	
}